Repository: soul99soul-glitch/AmberNovel-iOS
Catalog: iosApp/iosApp/Localizable.xcstrings
Source language: en
Languages: ja, ko, ru, zh_hans, zh_hant

# 当前只能在新议题里附加材料；追问请用文字补充。
source: You can only attach material to a new topic right now; use text for follow-up questions.
ja: 資料を添付できるのは新しいトピックのみです。追加入力はテキストで補足してください。
ko: 현재는 새 주제에서만 자료를 첨부할 수 있습니다. 추가 질문은 텍스트로 입력하세요.
ru: Сейчас материалы можно добавлять только в новой теме; уточнения добавляйте текстом.
zh_hans: 当前只能在新议题里附加材料；追问请用文字补充。
zh_hant: 目前只能在新議題中附加材料；追問請用文字補充。

# 当前地址不是有效的 HTTPS 或 HTTP IP 地址，请修正后再试。
source: The current address is not a valid HTTPS or HTTP IP address. Please correct it and try again.
ja: 現在のアドレスは、有効な HTTPS または HTTP の IP アドレスではありません。修正してからもう一度お試しください。
ko: 현재 주소는 유효한 HTTPS 또는 HTTP IP 주소가 아닙니다. 수정한 후 다시 시도하세요.
ru: Текущий адрес — недопустимый HTTPS- или HTTP IP-адрес. Исправьте его и повторите попытку.
zh_hans: 当前地址不是有效的 HTTPS 或 HTTP IP 地址，请修正后再试。
zh_hant: 目前位址不是有效的 HTTPS 或 HTTP IP 位址，請修正後再試。

# 当前引擎
source: Current engine
ja: 現在のエンジン
ko: 현재 엔진
ru: Текущий движок
zh_hans: 当前引擎
zh_hant: 目前引擎

# 当前执行策略
source: Current execution policy
ja: 現在の実行ポリシー
ko: 현재 실행 정책
ru: Текущая стратегия выполнения
zh_hans: 当前执行策略
zh_hant: 目前執行策略

# 当前损坏的主文件会被保留用于排查，上一个有效版本将成为新的可写版本。
source: The current corrupted main file will be kept for investigation; the previous valid version will become the new writable version.
ja: 破損したメインファイルは調査用に保持され、直前の有効なバージョンが新しい書き込み可能なバージョンになります。
ko: 현재 손상된 주 파일은 원인 조사를 위해 보존되며, 이전의 유효한 버전이 새 편집 가능 버전이 됩니다.
ru: Текущий повреждённый основной файл будет сохранён для диагностики, а последняя рабочая версия станет новой доступной для записи.
zh_hans: 当前损坏的主文件会被保留用于排查，上一个有效版本将成为新的可写版本。
zh_hant: 目前損毀的主檔案會保留以供排查；上一個有效版本將成為新的可寫入版本。

# 当前无法提交回答
source: Can't submit the answer right now
ja: 現在、回答を送信できません
ko: 현재 답변을 제출할 수 없습니다.
ru: Сейчас нельзя отправить ответ
zh_hans: 当前无法提交回答
zh_hant: 目前無法提交回答

# 当前服务商暂不支持聊天
source: The current provider does not support chat
ja: 現在のサービスプロバイダーはチャットに対応していません
ko: 현재 서비스 제공자는 채팅을 지원하지 않습니다.
ru: Этот провайдер пока не поддерживает чат
zh_hans: 当前服务商暂不支持聊天
zh_hant: 目前服務提供者暫不支援聊天

# 当前服务商类型暂不支持后台生成
source: This provider type doesn't currently support background generation
ja: 現在のサービスプロバイダーの種類はバックグラウンド生成に対応していません
ko: 현재 서비스 제공자 유형은 백그라운드 생성을 지원하지 않습니다.
ru: Этот тип провайдера пока не поддерживает фоновую генерацию
zh_hans: 当前服务商类型暂不支持后台生成
zh_hant: 目前的服務提供者類型暫不支援背景產生

# 当前服务商类型的 iOS 聊天执行器尚未移植，请先切换到 OpenAI 兼容或 Anthropic 服务商。
source: The iOS chat executor for this provider type has not been ported yet. Switch to an OpenAI-compatible or Anthropic provider first.
ja: 現在のサービスプロバイダー種別には、iOS チャット実行機能がまだ移植されていません。OpenAI 互換または Anthropic サービスプロバイダーに切り替えてください。
ko: 현재 서비스 제공자 유형에는 iOS 채팅 실행기가 아직 이식되지 않았습니다. 먼저 OpenAI 호환 또는 Anthropic 서비스 제공자로 전환하세요.
ru: iOS-исполнитель чата для этого типа провайдера ещё не портирован. Переключитесь на провайдера, совместимого с OpenAI, или на Anthropic.
zh_hans: 当前服务商类型的 iOS 聊天执行器尚未移植，请先切换到 OpenAI 兼容或 Anthropic 服务商。
zh_hant: 目前服務提供者類型的 iOS 聊天執行器尚未移植，請先切換至 OpenAI 相容或 Anthropic 服務提供者。

# 当前模型不支持图片，请先在「默认模型 → 辅助任务」配置视觉识别模型
source: The current model doesn't support images. Configure a vision model under “Default model → Auxiliary tasks” first.
ja: 現在のモデルは画像に対応していません。まず「デフォルトモデル → 補助タスク」で画像認識モデルを設定してください
ko: 현재 모델은 이미지를 지원하지 않습니다. 「기본 모델 → 보조 작업」에서 비전 인식 모델을 구성하세요.
ru: Текущая модель не поддерживает изображения. Сначала настройте модель визуального распознавания в «Модель по умолчанию → Вспомогательная задача»
zh_hans: 当前模型不支持图片，请先在「默认模型 → 辅助任务」配置视觉识别模型
zh_hant: 目前模型不支援圖片，請先在「預設模型 → 輔助任務」設定視覺識別模型

# 当前模型未标记支持 Reasoning
source: The current model isn't marked as supporting Reasoning
ja: 現在のモデルは Reasoning 対応としてマークされていません
ko: 현재 모델은 Reasoning 지원으로 표시되지 않았습니다.
ru: Для текущей модели не указана поддержка Reasoning.
zh_hans: 当前模型未标记支持推理
zh_hant: 目前模型未標示支援 Reasoning

# 当前正在生成回复，请稍后再修改。
source: A response is currently being generated; try editing again later.
ja: 現在、返信を生成中です。しばらくしてから変更してください。
ko: 현재 답변을 생성 중입니다. 잠시 후 다시 수정하세요.
ru: Идёт генерация ответа; попробуйте изменить позже.
zh_hans: 当前正在生成回复，请稍后再修改。
zh_hant: 目前正在產生回覆，請稍後再修改。

# 当前没有任务
source: No current task
ja: 現在、タスクはありません
ko: 현재 작업이 없습니다.
ru: Нет текущей задачи
zh_hans: 当前没有任务
zh_hant: 目前沒有任務

# 当前没有可取消的任务
source: No cancellable task
ja: 現在、キャンセルできるタスクはありません
ko: 현재 취소할 수 있는 작업이 없습니다.
ru: Нет задачи для отмены
zh_hans: 当前没有可取消的任务
zh_hant: 目前沒有可取消的任務

# 当前没有后台 entitlement；iOS 仅在前台刷新，并在启动时做补偿刷新。
source: There is currently no background entitlement; iOS refreshes only in the foreground and performs a catch-up refresh at launch.
ja: 現在、バックグラウンド entitlement はありません。iOS ではフォアグラウンドでのみ更新し、起動時に補完更新を行います。
ko: 현재 백그라운드 entitlement가 없습니다. iOS는 포그라운드에서만 새로 고치며, 시작할 때 누락분을 보완합니다.
ru: Сейчас нет фонового entitlement; iOS обновляет только на переднем плане и выполняет компенсирующее обновление при запуске.
zh_hans: 当前没有后台 entitlement；iOS 仅在前台刷新，并在启动时做补偿刷新。
zh_hant: 目前沒有背景 entitlement；iOS 僅在前景重新整理，並在啟動時進行補償性重新整理。

# 当前没有待确认的操作
source: No operation awaiting confirmation
ja: 現在、確認待ちの操作はありません
ko: 현재 확인 대기 중인 작업이 없습니다.
ru: Нет операций, ожидающих подтверждения
zh_hans: 当前没有待确认的操作
zh_hant: 目前沒有待確認的操作

# 当前没有等待回答的问题
source: No question awaiting an answer
ja: 現在、回答待ちの質問はありません
ko: 현재 답변을 기다리는 질문이 없습니다.
ru: Нет вопросов, ожидающих ответа
zh_hans: 当前没有等待回答的问题
zh_hant: 目前沒有等待回答的問題

# 当前状态暂不能修改章节状态
source: The chapter status cannot be changed in the current state
ja: 現在の状態では章の状態を変更できません
ko: 현재 상태에서는 장 상태를 수정할 수 없습니다.
ru: В текущем состоянии нельзя изменить статус главы
zh_hans: 当前状态暂不能修改章节状态
zh_hant: 目前狀態暫時無法修改章節狀態

# 当前状态暂不能生成
source: Generation is unavailable in the current state
ja: 現在の状態では生成できません
ko: 현재 상태에서는 생성할 수 없습니다.
ru: В текущем состоянии генерация недоступна
zh_hans: 当前状态暂不能生成
zh_hant: 目前狀態暫時無法產生

# 当前状态暂不能编辑
source: Editing is unavailable in the current state
ja: 現在の状態では編集できません
ko: 현재 상태에서는 편집할 수 없습니다.
ru: В текущем состоянии редактирование недоступно
zh_hans: 当前状态暂不能编辑
zh_hant: 目前狀態暫時無法編輯

# 当前稳定 target 只提供 Remote SSH 和本地轻量工具作为默认 Runtime；聊天里的 iSH 交接能力在下方单独说明。
source: The current stable target only provides Remote SSH and lightweight local tools as the default Runtime; iSH handoff in chat is described separately below.
ja: 現在の安定版targetでは、デフォルトRuntimeとしてRemote SSHとローカルの軽量ツールのみ提供します。チャットのiSH引き継ぎ機能は下記で個別に説明します。
ko: 현재 안정적인 target에서는 Remote SSH와 로컬 경량 도구만 기본 Runtime으로 제공합니다. 채팅의 iSH 인계 기능은 아래에서 별도로 설명합니다.
ru: Текущий стабильный target по умолчанию предоставляет только Remote SSH и локальные лёгкие инструменты как Runtime; передача iSH из чата описана ниже отдельно.
zh_hans: 当前稳定 target 只提供 Remote SSH 和本地轻量工具作为默认 Runtime；聊天里的 iSH 交接能力在下方单独说明。
zh_hant: 目前穩定 target 只提供 Remote SSH 和本機輕量工具作為預設 Runtime；聊天中的 iSH 交接能力會在下方個別說明。

# 当前章尾
source: Current chapter ending
ja: 現在の章の末尾
ko: 현재 장 끝
ru: Конец текущей главы
zh_hans: 当前章尾
zh_hant: 目前章結尾

# 当前章节
source: Current chapter
ja: 現在の章
ko: 현재 장
ru: Текущая глава
zh_hans: 当前章节
zh_hant: 目前章節

# 当前设置不可用，无法重试
source: Current settings are unavailable; can't retry
ja: 現在の設定は利用できないため、再試行できません
ko: 현재 설정을 사용할 수 없어 다시 시도할 수 없습니다.
ru: Текущие настройки недоступны, повторить нельзя
zh_hans: 当前设置不可用，无法重试
zh_hant: 目前設定無法使用，無法重試

# 当前还有进行中的生成
source: A generation is already in progress
ja: 進行中の生成があります
ko: 현재 진행 중인 생성이 있습니다.
ru: Сейчас уже идёт генерация
zh_hans: 当前还有进行中的生成
zh_hant: 目前還有進行中的產生作業

# 当前项目没有资料。
source: No materials in this project.
ja: このプロジェクトにはまだ資料がありません。
ko: 현재 프로젝트에 자료가 없습니다.
ru: В текущем проекте нет материалов.
zh_hans: 当前项目没有资料。
zh_hant: 目前專案沒有資料。

# 往后几章
source: Upcoming chapters
ja: この先の数章
ko: 다음 몇 장
ru: Следующие главы
zh_hans: 往后几章
zh_hant: 往後幾章

# 待命
source: Idle
ja: 待機中
ko: 대기
ru: В режиме ожидания
zh_hans: 待命
zh_hant: 待命

# 待接入
source: Not yet connected
ja: 未接続
ko: 연동 예정
ru: Пока не подключено
zh_hans: 待接入
zh_hant: 待接入

# 待润修%@
source: Awaiting revision%@
ja: 推敲待ち%@
ko: 다듬기 대기 중%@
ru: Ожидает доработки%@
zh_hans: 待润修%@
zh_hant: 待潤修%@

# 待生成
source: Pending generation
ja: 生成待ち
ko: 생성 대기
ru: Ожидает генерации
zh_hans: 待生成
zh_hant: 待產生

# 待确认建议
source: Suggestions awaiting confirmation
ja: 確認待ち候補
ko: 확인 대기 제안
ru: Предложения на подтверждение
zh_hans: 待确认建议
zh_hant: 待確認建議

# 待确认操作因 App 重启已终止，请重新生成。
source: The operation awaiting confirmation was terminated because the App restarted. Generate again.
ja: App の再起動により確認待ちの操作が終了しました。再生成してください。
ko: App 재시작으로 확인 대기 작업이 종료되었습니다. 다시 생성하세요.
ru: Операция, ожидавшая подтверждения, прервана из-за перезапуска приложения. Запустите генерацию снова.
zh_hans: 待确认操作因 App 重启已终止，请重新生成。
zh_hant: 待確認操作因 App 重新啟動而終止，請重新產生。

# 待确认角色建议
source: Character suggestions awaiting confirmation
ja: 確認待ちキャラクター候補
ko: 확인 대기 캐릭터 제안
ru: Предложения по персонажам на подтверждение
zh_hans: 待确认角色建议
zh_hant: 待確認角色建議

# 待继续任务更新：%@，%@，%@
source: Resumable task update: %@, %@, %@
ja: 続行待ちタスクの更新：%@、%@、%@
ko: 계속 작업 업데이트: %@, %@, %@
ru: Обновление ожидающей задачи: %@, %@, %@
zh_hans: 待继续任务更新：%@，%@，%@
zh_hant: 待繼續任務更新：%@，%@，%@

# 必发生（每行一条）
source: Must happen (one per line)
ja: 必ず起きること（1行に1つ）
ko: 반드시 발생할 일(한 줄에 하나씩)
ru: Должно произойти (по одному пункту в строке)
zh_hans: 必发生（每行一条）
zh_hant: 必發生（每行一項）

# 快速开始
source: Quick start
ja: クイックスタート
ko: 빠른 시작
ru: Быстрый старт
zh_hans: 快速开始
zh_hant: 快速開始

# 快速开始信息
source: Quick-start information
ja: クイックスタート情報
ko: 빠른 시작 정보
ru: Информация для быстрого старта
zh_hans: 快速开始信息
zh_hant: 快速開始資訊

# 快速批准
source: Quick approve
ja: クイック承認
ko: 빠른 승인
ru: Быстрое одобрение
zh_hans: 快速批准
zh_hant: 快速核準

# 忽略
source: Ignore
ja: 無視
ko: 무시
ru: Пропустить
zh_hans: 忽略
zh_hant: 忽略

# 思考中 %lld 秒%@
source: Thinking for %lld seconds%@
ja: 思考中 %lld 秒%@
ko: 생각 중 %lld초%@
ru: Размышляет %lld с%@
zh_hans: 思考中 %lld 秒%@
zh_hant: 思考中 %lld 秒%@

# 思考中%@
source: Thinking%@
ja: 思考中%@
ko: 생각 중%@
ru: Размышляет%@
zh_hans: 思考中%@
zh_hant: 思考中%@

# 思考了 %@ 秒%@
source: Thought for %@ seconds%@
ja: %@ 秒%@考えました
ko: %@초 동안 생각함%@
ru: Размышлял %@ с%@
zh_hans: 思考了 %@ 秒%@
zh_hant: 思考了 %@ 秒%@

# 思考过程%@
source: Reasoning%@
ja: 思考プロセス%@
ko: 사고 과정%@
ru: Ход мыслей%@
zh_hans: 思考过程%@
zh_hant: 思考過程%@

# 总剧情大纲
source: Overall plot outline
ja: ストーリー全体のプロット
ko: 전체 스토리 개요
ru: Общий план сюжета
zh_hans: 总剧情大纲
zh_hant: 總劇情大綱

# 总结
source: Summary
ja: 要約
ko: 요약
ru: Сводка
zh_hans: 总结
zh_hant: 總結

# 恢复
source: Restore
ja: 復元
ko: 복원
ru: Восстановить
zh_hans: 恢复
zh_hant: 復原

# 恢复 v%lld
source: Restore v%lld
ja: v%lldを復元
ko: v%lld 복원
ru: Восстановить v%lld
zh_hans: 恢复 v%lld
zh_hant: 復原 v%lld

# 恢复「%@」的记忆抽取
source: Restore memory extraction for “%@”
ja: 「%@」のメモリ抽出を復元
ko: “%@”의 메모리 추출 복원
ru: Восстановить извлечение воспоминаний из «%@»
zh_hans: 恢复「%@」的记忆抽取
zh_hant: 復原「%@」的記憶擷取

# 恢复上一个有效版本？
source: Restore the previous valid version?
ja: 直前の有効なバージョンに復元しますか？
ko: 이전 유효 버전을 복원할까요?
ru: Восстановить последнюю рабочую версию?
zh_hans: 恢复上一个有效版本？
zh_hant: 復原上一個有效版本？

# 恢复为当前版本
source: Restore as current version
ja: 現在のバージョンとして復元
ko: 현재 버전으로 복원
ru: Сделать текущей версией
zh_hans: 恢复为当前版本
zh_hant: 復原為目前版本

# 恢复会话记忆
source: Restore conversation memory
ja: セッションの記憶を復元
ko: 세션 메모리 복구
ru: Восстановить память сеанса
zh_hans: 恢复会话记忆
zh_hant: 恢復會話記憶

# 恢复内置站点
source: Restore built-in sites
ja: 内蔵サイトを復元
ko: 기본 사이트 복원
ru: Восстановить встроенные сайты
zh_hans: 恢复内置站点
zh_hant: 復原內建站點

# 恢复出厂
source: Restore factory defaults
ja: 工場出荷時に戻す
ko: 공장 초기화
ru: Сбросить к заводским настройкам
zh_hans: 恢复出厂
zh_hant: 還原原廠

# 恢复出厂备份
source: Restore factory backup
ja: 初期バックアップを復元
ko: 초기화 백업 복원
ru: Восстановить заводскую резервную копию
zh_hans: 恢复出厂备份
zh_hant: 還原原廠備份

# 恢复可写
source: Restore write access
ja: 書き込み可能に戻す
ko: 쓰기 가능으로 복원
ru: Сделать снова доступным для записи
zh_hans: 恢复可写
zh_hant: 復原可寫入

# 恢复后台生成
source: Resume background generation
ja: バックグラウンド生成を復元
ko: 백그라운드 생성 복구
ru: Восстановить фоновую генерацию
zh_hans: 恢复后台生成
zh_hant: 恢復背景產生

# 恢复并继续编辑
source: Restore and continue editing
ja: 復元して編集を続ける
ko: 복원하고 편집 계속
ru: Восстановить и продолжить редактирование
zh_hans: 恢复并继续编辑
zh_hant: 恢復並繼續編輯

# 恢复推荐
source: Restore recommendation
ja: 推奨を復元
ko: 추천 설정 복원
ru: Восстановить рекомендации
zh_hans: 恢复推荐
zh_hant: 復原推薦

# 恢复本章
source: Restore chapter
ja: 本章を復元
ko: 이 장 복원
ru: Восстановить главу
zh_hans: 恢复本章
zh_hant: 復原本章

# 恢复模型响应
source: Restore model response
ja: モデル応答を復元
ko: 모델 응답 복구
ru: Восстановить ответ модели
zh_hans: 恢复模型响应
zh_hant: 恢復模型回應

# 恢复生成正文
source: Resume text generation
ja: 生成本文を復元
ko: 본문 생성 복구
ru: Восстановить сгенерированный текст
zh_hans: 恢复生成正文
zh_hant: 恢復產生正文

# 恢复跟随终端输出
source: Resume following terminal output
ja: ターミナル出力への追従を再開
ko: 터미널 출력 따라가기 재개
ru: Снова следить за выводом терминала
zh_hans: 恢复跟随终端输出
zh_hant: 恢復跟隨終端輸出

# 恢复预览
source: Restore preview
ja: プレビューを復元
ko: 미리보기 복원
ru: Восстановить превью
zh_hans: 恢复预览
zh_hant: 復原預覽

# 情节重复
source: Repeated plot
ja: ストーリーの重複
ko: 스토리 반복
ru: Повтор сюжета
zh_hans: 情节重复
zh_hant: 情節重複

# 想聊哪段剧情、人物或设定？
source: Which plot, character, or setting would you like to discuss?
ja: どのストーリー、キャラクター、設定について話しますか？
ko: 어떤 스토리, 인물 또는 설정을 이야기할까요?
ru: Какой сюжетный фрагмент, персонажа или сеттинг обсудить?
zh_hans: 想聊哪段剧情、人物或设定？
zh_hant: 想聊哪段劇情、人物或設定？

# 我的小应用
source: My mini-apps
ja: マイミニアプリ
ko: 내 미니 앱
ru: Мои мини-приложения
zh_hans: 我的小应用
zh_hant: 我的小應用

# 我的账户
source: My account
ja: マイアカウント
ko: 내 계정
ru: Моя учётная запись
zh_hans: 我的账户
zh_hant: 我的帳號

# 或者直接输入自己的选择
source: Or enter your own choice
ja: または選択を直接入力してください
ko: 또는 원하는 선택을 직접 입력하세요.
ru: Или введите свой вариант
zh_hans: 或者直接输入自己的选择
zh_hant: 或者直接輸入自己的選擇

# 或者输入自己的回答
source: Or enter your own answer
ja: または自分の回答を入力
ko: 또는 직접 답변 입력
ru: Или введите свой ответ
zh_hans: 或者输入自己的回答
zh_hant: 或者輸入自己的回答

# 所选文件授权不匹配，请重新选择文件。
source: The selected file's authorization doesn't match. Select the file again.
ja: 選択したファイルの権限が一致しません。ファイルを選び直してください。
ko: 선택한 파일 권한이 일치하지 않습니다. 다시 선택하세요.
ru: Разрешение выбранного файла не соответствует. Выберите файл заново.
zh_hans: 所选文件授权不匹配，请重新选择文件。
zh_hant: 所選檔案授權不相符，請重新選擇檔案。

# 手动同步
source: Manual sync
ja: 手動同期
ko: 수동 동기화
ru: Синхронизировать вручную
zh_hans: 手动同步
zh_hant: 手動同步

# 手动改写没有保存，请稍后重试。
source: Manual rewrite wasn't saved. Please try again later.
ja: 手動リライトを保存できませんでした。後でもう一度お試しください。
ko: 수동 재작성을 저장하지 못했습니다. 나중에 다시 시도하세요.
ru: Ручное переписывание не сохранено. Повторите позже.
zh_hans: 手动改写没有保存，请稍后重试。
zh_hant: 手動改寫沒有儲存，請稍後重試。

# 手动文本
source: Manual text
ja: 手動入力テキスト
ko: 수동 텍스트
ru: Ручной текст
zh_hans: 手动文本
zh_hant: 手動文字

# 手动编辑
source: Manual edit
ja: 手動編集
ko: 수동 편집
ru: Редактировать вручную
zh_hans: 手动编辑
zh_hant: 手動編輯

# 打开
source: Open
ja: 開く
ko: 열기
ru: Открыть
zh_hans: 打开
zh_hant: 開啟

# 打开其他小应用
source: Open another MiniApp
ja: 他の MiniApp を開く
ko: 다른 MiniApp 열기
ru: Открыть другие MiniApp
zh_hans: 打开其他小应用
zh_hant: 開啟其他小應用

# 打开原文
source: Open original
ja: 原文を開く
ko: 원문 열기
ru: Открыть оригинал
zh_hans: 打开原文
zh_hant: 開啟原文

# 打开另一个小应用？
source: Open another MiniApp?
ja: 別のミニアプリを開きますか？
ko: 다른 MiniApp을 열까요?
ru: Открыть другое мини-приложение?
zh_hans: 打开另一个小应用？
zh_hant: 要開啟另一個小應用嗎？

# 打开另一个已保存的小应用
source: Open another saved mini app
ja: 保存済みの別のミニアプリを開く
ko: 저장된 다른 MiniApp 열기
ru: Открыть другое сохранённое мини-приложение
zh_hans: 打开另一个已保存的小应用
zh_hant: 開啟另一個已儲存的小應用

# 打开小应用
source: Open mini-app
ja: ミニアプリを開く
ko: 미니 앱 열기
ru: Открыть мини-приложение
zh_hans: 打开小应用
zh_hant: 開啟小應用

# 打开小应用或使用权限后会出现记录。
source: A record will appear after you open a MiniApp or use a permission.
ja: ミニアプリを開くか権限を使用すると、記録が表示されます。
ko: MiniApp을 열거나 권한을 사용하면 기록이 표시됩니다.
ru: Записи появятся после открытия мини-приложения или использования разрешений.
zh_hans: 打开小应用或使用权限后会出现记录。
zh_hant: 開啟小應用或使用權限後會出現記錄。

# 打开系统文件选择器，只允许读取你选中的单个文件
source: Opens the system file picker, reading only the single file you select
ja: システムのファイル選択画面を開き、選択した1つのファイルのみを読み取ります。
ko: 시스템 파일 선택기를 열고, 선택한 파일 하나만 읽을 수 있습니다.
ru: Открывается системный выбор файлов; разрешено читать только один выбранный вами файл
zh_hans: 打开系统文件选择器，只允许读取你选中的单个文件
zh_hant: 開啟系統檔案選擇器，僅允許讀取你選取的單一檔案

# 打开终端键盘
source: Open terminal keyboard
ja: ターミナルキーボードを開く
ko: 터미널 키보드 열기
ru: Открыть клавиатуру терминала
zh_hans: 打开终端键盘
zh_hant: 開啟終端鍵盤

# 打开网页登录
source: Open web sign-in
ja: Webログインを開く
ko: 웹 로그인 열기
ru: Открыть веб-вход
zh_hans: 打开网页登录
zh_hant: 開啟網頁登入

# 执行 MCP 工具
source: Run MCP tool
ja: MCP ツールを実行
ko: MCP 도구 실행
ru: Выполнить инструмент MCP
zh_hans: 执行 MCP 工具
zh_hant: 執行 MCP 工具

# 执行 Recipe 步骤
source: Run Recipe step
ja: Recipe のステップを実行
ko: Recipe 단계 실행
ru: Выполнить шаг Recipe
zh_hans: 执行 Recipe 步骤
zh_hant: 執行 Recipe 步驟

# 执行 Remote SSH
source: Run Remote SSH
ja: Remote SSH を実行
ko: Remote SSH 실행
ru: Выполнить Remote SSH
zh_hans: 执行 Remote SSH
zh_hant: 執行 Remote SSH

# 执行 WebMount 前台动作
source: Run WebMount foreground action
ja: WebMount のフォアグラウンド操作を実行
ko: WebMount 포그라운드 동작 실행
ru: Выполнить действие WebMount на переднем плане
zh_hans: 执行站点前台动作
zh_hant: 執行站點前景動作

# 执行公开网页搜索
source: Run public web search
ja: 公開ウェブ検索を実行
ko: 공개 웹 검색 실행
ru: Выполнить поиск в открытом интернете
zh_hans: 执行公开网页搜索
zh_hant: 執行公開網頁搜尋

# 执行内置 iSH
source: Run built-in iSH
ja: 内蔵 iSH を実行
ko: 내장 iSH 실행
ru: Выполнить во встроенном iSH
zh_hans: 执行内置 iSH
zh_hant: 執行內建 iSH

# 执行网络搜索
source: Run web search
ja: ウェブ検索を実行
ko: 웹 검색 실행
ru: Выполнить поиск в интернете
zh_hans: 执行网络搜索
zh_hant: 執行網路搜尋

# 扩展
source: Extensions
ja: 拡張機能
ko: 확장
ru: Расширения
zh_hans: 扩展
zh_hant: 擴充功能

# 扩展阅读
source: Further reading
ja: 関連資料
ko: 추가 읽기
ru: Дополнительное чтение
zh_hans: 扩展阅读
zh_hant: 延伸閱讀

# 扫描、连接或访问附近蓝牙设备前申请
source: Permission is requested before scanning for, connecting to, or accessing nearby Bluetooth devices
ja: 近くのBluetoothデバイスをスキャン、接続、またはアクセスする前に許可を求めます。
ko: 주변 Bluetooth 기기를 검색, 연결 또는 사용하기 전에 권한을 요청합니다.
ru: Перед сканированием, подключением или доступом к устройствам Bluetooth поблизости будет запрошено разрешение
zh_hans: 扫描、连接或访问附近蓝牙设备前申请
zh_hant: 掃描、連線或存取附近的藍牙裝置前申請

# 扫描了 %lld 章，发现 %lld 处问题
source: Scanned %1$lld chapters and found %2$lld issues
ja: %1$lld章をスキャンし、%2$lld件の問題が見つかりました
ko: %1$lld장을 스캔해 %2$lld개의 문제를 찾았습니다
ru: Проверено глав: %1$lld; найдено проблем: %2$lld
zh_hans: 扫描了 %1$lld 章，发现 %2$lld 处问题
zh_hant: 已掃描 %1$lld 章，發現 %2$lld 處問題

# 批内尚未完成时会自动规划下一章，有后续参考时优先采用
source: If the batch isn't finished, the next chapter is planned automatically; available references for later chapters take priority.
ja: バッチ内で未完了の場合は次の章を自動で計画し、後続の参照があれば優先して使用します。
ko: 현재 배치가 완료되지 않으면 다음 장을 자동으로 계획하며, 이후 참고 자료가 있으면 우선 사용합니다.
ru: Если текущая партия ещё не завершена, следующая глава будет спланирована автоматически; при наличии последующих материалов они будут использованы в первую очередь.
zh_hans: 批内尚未完成时会自动规划下一章，有后续参考时优先采用
zh_hant: 批次尚未完成時會自動規劃下一章，有後續參考資料時會優先採用

# 批准
source: Approve
ja: 承認
ko: 승인
ru: Одобрить
zh_hans: 批准
zh_hant: 核准

# 批准 Recipe 操作
source: Approve Recipe action
ja: Recipe操作を承認
ko: Recipe 작업 승인
ru: Одобрить действие Recipe
zh_hans: 批准 Recipe 操作
zh_hant: 核准 Recipe 操作

# 批准 Workspace 工具
source: Approve Workspace tool
ja: Workspaceツールを承認
ko: Workspace 도구 승인
ru: Одобрить инструмент Workspace
zh_hans: 批准 Workspace 工具
zh_hant: 核准 Workspace 工具

# 批准%@
source: Approve %@
ja: %@を承認
ko: 승인 %@
ru: Одобрить %@
zh_hans: 批准%@
zh_hant: 核准%@

# 批准后 %@
source: After approval %@
ja: 承認後 %@
ko: 승인 후 %@
ru: После одобрения %@
zh_hans: 批准后 %@
zh_hant: 核准後 %@

# 批准后从下一模型轮生效。
source: Takes effect from the next model round after approval.
ja: 承認後、次のモデルラウンドから適用されます。
ko: 승인 후 다음 모델 라운드부터 적용됩니다.
ru: После одобрения вступит в силу со следующего раунда модели.
zh_hans: 批准后从下一模型轮生效。
zh_hant: 核准後從下一輪模型請求起生效。

# 批准后内容未展示（文件较大或非文本；已纳入包哈希）
source: Approved content not shown (file is too large or non-text; included in package hash)
ja: 承認後の内容は表示されません（ファイルが大きいか、テキストではありません。パッケージハッシュには含まれます）
ko: 승인 후 내용은 표시되지 않음(파일이 크거나 텍스트가 아님; 패키지 해시에 포함됨)
ru: Содержимое после одобрения не показано (файл слишком большой или не текстовый; учтено в хеше пакета)
zh_hans: 批准后内容未展示（文件较大或非文本；已纳入包哈希）
zh_hant: 核准後內容未顯示（檔案過大或非文字；已納入套件雜湊）

# 批准后摘要：%@
source: Approved summary: %@
ja: 承認後の概要：%@
ko: 승인 후 요약: %@
ru: Сводка после одобрения: %@
zh_hans: 批准后摘要：%@
zh_hant: 核准後摘要：%@

# 批准模型议会
source: Approve model council
ja: モデル議会を承認
ko: 모델 의회 승인
ru: Одобрить совет моделей
zh_hans: 批准模型议会
zh_hant: 核准模型議會

# 批准网络搜索
source: Approve web search
ja: ウェブ検索を承認
ko: 웹 검색 승인
ru: Одобрить веб-поиск
zh_hans: 批准网络搜索
zh_hant: 核准網路搜尋

# 批量已暂停
source: Batch paused
ja: 一括処理を一時停止しました
ko: 일괄 작업 일시 중지됨
ru: Пакетная обработка приостановлена
zh_hans: 批量已暂停
zh_hant: 批次已暫停

# 批量整章润色
source: Batch-polish full chapters
ja: 章全体を一括推敲
ko: 장 전체 일괄 다듬기
ru: Пакетная редактура целых глав
zh_hans: 批量整章润色
zh_hant: 批次整章潤飾

# 批量润色
source: Batch polish
ja: 一括推敲
ko: 일괄 다듬기
ru: Пакетная редактура
zh_hans: 批量润色
zh_hant: 批次潤飾

# 找不到这个小应用
source: Mini app not found
ja: このミニアプリが見つかりません
ko: 이 미니 앱을 찾을 수 없습니다.
ru: Мини-приложение не найдено
zh_hans: 找不到这个小应用
zh_hant: 找不到這個小應用

# 找不到这个小应用的已保存内容。
source: Saved content for this MiniApp wasn't found.
ja: このミニアプリの保存済みコンテンツが見つかりません。
ko: 이 MiniApp의 저장된 콘텐츠를 찾을 수 없습니다.
ru: Сохранённое содержимое этого мини-приложения не найдено.
zh_hans: 找不到这个小应用的已保存内容。
zh_hant: 找不到這個小應用的已儲存內容。

# 找不到这个服务商
source: Provider not found
ja: このプロバイダーが見つかりません
ko: 이 서비스 제공업체를 찾을 수 없습니다.
ru: Поставщик не найден
zh_hans: 找不到这个服务商
zh_hant: 找不到這個服務提供者

# 技能
source: Skills
ja: スキル
ko: 스킬
ru: Навыки
zh_hans: 技能
zh_hant: 技能

# 技能详情
source: Skill details
ja: スキルの詳細
ko: 스킬 세부 정보
ru: Сведения о навыке
zh_hans: 技能详情
zh_hant: 技能詳情

# 把文本写入剪贴板
source: Write text to clipboard
ja: テキストをクリップボードに書き込む
ko: 텍스트를 클립보드에 쓰기
ru: Записать текст в буфер обмена
zh_hans: 把文本写入剪贴板
zh_hant: 將文字寫入剪貼簿

# 抽章审批
source: Chapter extraction approval
ja: 章の抜粋を承認
ko: 장 추출 승인
ru: Согласование извлечения главы
zh_hans: 抽章审批
zh_hant: 抽章審批

# 拒绝
source: Reject
ja: 拒否
ko: 거부
ru: Отклонить
zh_hans: 拒绝
zh_hant: 拒絕

# 拒绝 Recipe 操作
source: Reject Recipe action
ja: Recipe操作を拒否
ko: Recipe 작업 거부
ru: Отклонить действие Recipe
zh_hans: 拒绝 Recipe 操作
zh_hant: 拒絕 Recipe 操作

# 拒绝 WebMount 前台动作
source: Reject WebMount foreground action
ja: WebMountフォアグラウンド操作を拒否
ko: WebMount 포그라운드 동작 거부
ru: Отклонить действие WebMount на переднем плане
zh_hans: 拒绝站点前台动作
zh_hant: 拒絕站點前景動作

# 拒绝 Workspace 工具
source: Reject Workspace tool
ja: Workspaceツールを拒否
ko: Workspace 도구 거부
ru: Отклонить инструмент Workspace
zh_hans: 拒绝 Workspace 工具
zh_hant: 拒絕 Workspace 工具

# 拒绝%@
source: Reject %@
ja: %@を拒否
ko: 거부 %@
ru: Отклонить %@
zh_hans: 拒绝%@
zh_hant: 拒絕%@

# 拒绝全部待确认
source: Reject all pending confirmations
ja: すべての確認待ち候補を拒否
ko: 확인 대기 항목 모두 거부
ru: Отклонить все ожидающие подтверждения
zh_hans: 拒绝全部待确认
zh_hant: 拒絕全部待確認

# 拒绝全部待确认设定建议
source: Reject all pending setting suggestions
ja: すべての確認待ち設定候補を拒否
ko: 확인 대기 설정 제안 모두 거부
ru: Отклонить все ожидающие предложения по сеттингу
zh_hans: 拒绝全部待确认设定建议
zh_hant: 拒絕全部待確認設定建議

# 拒绝当前分支上所有分类的待确认设定建议，不会写入资料
source: Reject all pending setting suggestions in the current branch, across all categories; nothing will be written to the records.
ja: 現在のブランチにある全カテゴリの確認待ち設定候補を拒否します。資料には書き込みません
ko: 현재 브랜치의 모든 분류에서 확인 대기 중인 설정 제안을 거부합니다. 자료에는 기록되지 않습니다.
ru: Отклонить все ожидающие предложения по сеттингу во всех категориях текущей ветки; они не будут записаны в материалы
zh_hans: 拒绝当前分支上所有分类的待确认设定建议，不会写入资料
zh_hant: 拒絕目前分支上所有分類的待確認設定建議，不會寫入資料

# 拒绝模型议会
source: Reject model council
ja: モデル議会を拒否
ko: 모델 의회 거부
ru: Отклонить совет моделей
zh_hans: 拒绝模型议会
zh_hant: 拒絕模型議會

# 拒绝网络搜索
source: Reject web search
ja: ウェブ検索を拒否
ko: 웹 검색 거부
ru: Отклонить веб-поиск
zh_hans: 拒绝网络搜索
zh_hant: 拒絕網路搜尋

# 拒绝记忆写入
source: Reject memory write
ja: メモリへの書き込みを拒否
ko: 메모리 쓰기 거부
ru: Отклонить запись воспоминаний
zh_hans: 拒绝记忆写入
zh_hant: 拒絕記憶寫入

# 拒绝这次修改
source: Reject this edit
ja: この変更を拒否
ko: 이번 수정 거부
ru: Отклонить это изменение
zh_hans: 拒绝这次修改
zh_hant: 拒絕這次修改

# 拖动调整优先级
source: Drag to adjust priority
ja: ドラッグして優先度を調整
ko: 드래그하여 우선순위 조정
ru: Перетащите для изменения приоритета
zh_hans: 拖动调整优先级
zh_hant: 拖曳調整優先順序

# 按审稿意见最小修复
source: Make the minimal fix based on review comments
ja: レビュー指摘に基づく最小限の修正
ko: 검토 의견에 따라 최소 수정
ru: Внести минимальные исправления по замечаниям рецензента
zh_hans: 按审稿意见最小修复
zh_hant: 依照審稿意見進行最小幅度修正

# 按审稿意见润修
source: Polish based on review
ja: レビューコメントに沿って推敲
ko: 검토 의견에 따라 다듬기
ru: Доработать по замечаниям редактора
zh_hans: 按审稿意见润修
zh_hant: 依審稿意見潤修
